Week 05/vet_app_pt_2/app/controllers/owners_controller.rb

  def index
    @owners = Owner.all
---
SELECT "owners".* FROM "owners"

  def create
    Owner.create(owner_params)
---
INSERT INTO "owners" ("first_name", "last_name", "address", "city", "province", "postal_code", "telephone", "email") VALUES (?, ?, ?, ?, ?, ?, ?, ?)