Week 05/vet_app_pt_2/app/controllers/pets_controller.rb

  def index
    @pets = Pet.order(:name)
---
SELECT "pets".* FROM "pets"  ORDER BY "pets"."name" ASC

  def show
    @pet = Pet.find(params[:id])
---
SELECT  "pets".* FROM "pets" WHERE "pets"."id" = ? LIMIT 1  [["id", 1]]

  def create
    Pet.create(pet_params)
---
INSERT INTO "pets" ("name", "species", "breed", "owner_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Hesther the Gerbil"], ["species", "Gerbil"], ["breed", "Gerbil"], ["owner_id", 2], ["created_at", "2016-05-02 02:21:32.787039"], ["updated_at", "2016-05-02 02:21:32.787039"]]

  def edit
    @pet = Pet.find(params[:id])
---
SELECT  "pets".* FROM "pets" WHERE "pets"."id" = ? LIMIT 1  [["id", 1]]

  def update
    @pet = Pet.find(params[:id])
    @pet.update_attributes(pet_params)
---
SELECT  "pets".* FROM "pets" WHERE "pets"."id" = ? LIMIT 1  [["id", 7]]
UPDATE "pets" SET "name" = ?, "species" = ?, "breed" = ?, "updated_at" = ? WHERE "pets"."id" = ?  [["name", "Henry"], ["species", "Cat"], ["breed", "DSH"], ["updated_at", "2016-03-12 19:12:39.420922"], ["id", 7]]

  def destroy
    @pet = Pet.find(params[:id])
    @pet.destroy
---
SELECT  "pets".* FROM "pets" WHERE "pets"."id" = ? LIMIT 1  [["id", 18]]
DELETE FROM "pets" WHERE "pets"."id" = ?  [["id", 18]]