Week 05/potluck/app/views/dishes/_form.html.erb

SELECT "events".* FROM "events"
---
  <%= f.label :event %>
    <%= f.select :event_id, options_from_collection_for_select(Event.all, 'id', 'name') %>