Week 05/vet_app_pt_2/app/views/pets/_form.html.erb

SELECT "owners".* FROM "owners"
---
    <%= f.label :owner %>
    <%= f.select :owner_id, options_from_collection_for_select(Owner.all, 'id', 'full_name') %>