Week 05/vet_app_pt_1/app/controllers/pets_controller.rb

SELECT "pets".* FROM "pets"  ORDER BY "pets"."name" ASC
---
  def index
    @pets = Pet.order(:name)

SELECT  "pets".* FROM "pets" WHERE "pets"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @pet = Pet.find(params[:id])

INSERT INTO "pets" ("name", "species", "breed", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Snowball"], ["species", "Cat"], ["breed", "DSH"], ["created_at", "2016-04-02 18:31:08.508740"], ["updated_at", "2016-04-02 18:31:08.508740"]]
---
  def create
    Pet.create(pet_params)

SELECT  "pets".* FROM "pets" WHERE "pets"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    @pet = Pet.find(params[:id])

SELECT  "pets".* FROM "pets" WHERE "pets"."id" = ? LIMIT 1  [["id", 7]]
UPDATE "pets" SET "name" = ?, "species" = ?, "breed" = ?, "updated_at" = ? WHERE "pets"."id" = ?  [["name", "Henry"], ["species", "Cat"], ["breed", "DSH"], ["updated_at", "2016-03-12 19:12:39.420922"], ["id", 7]]
---
  def update
    @pet = Pet.find(params[:id])
    @pet.update_attributes(pet_params)

SELECT  "pets".* FROM "pets" WHERE "pets"."id" = ? LIMIT 1  [["id", 18]]
DELETE FROM "pets" WHERE "pets"."id" = ?  [["id", 18]]
---
  def destroy
    @pet = Pet.find(params[:id])
    @pet.destroy