Week 05/potluck/app/controllers/dishes_controller.rb

SELECT "dishes".* FROM "dishes"
---
  def index
    @dishes = Dish.all

SELECT  "dishes".* FROM "dishes" WHERE "dishes"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", nil]]
---
  def show
    @dish = Dish.find(params[:id])
    @event = Event.find(@dish.event_id)

INSERT INTO "dishes" ("name", "type_of_dish", "main_ingredient", "serving_size", "event_id", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Brand new dish again"], ["type_of_dish", "Appetizer"], ["main_ingredient", "Herding announcer"], ["serving_size", 10], ["event_id", 6], ["user_id", 1]]
---
  def create
    @dish = Dish.create(dish_params)

SELECT  "dishes".* FROM "dishes" WHERE "dishes"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    @dish = Dish.find(params[:id])

SELECT  "dishes".* FROM "dishes" WHERE "dishes"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "dishes" SET "main_ingredient" = ?, "event_id" = ? WHERE "dishes"."id" = ?  [["main_ingredient", "Hayum"], ["event_id", 1], ["id", 37]]
---
  def update
    @dish = Dish.find(params[:id])
    @dish.update(dish_params)

SELECT  "dishes".* FROM "dishes" WHERE "dishes"."id" = ? LIMIT 1  [["id", 3]]
DELETE FROM "dishes" WHERE "dishes"."id" = ?  [["id", 3]]
---
  def destroy
    @dish = Dish.find(params[:id])
    @dish.destroy