Week 05/potluck/app/controllers/events_controller.rb

SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", 1]]
SELECT "dishes".* FROM "dishes" WHERE "dishes"."event_id" = ?  [["event_id", 2]]
---
  def show
    @event = Event.find(params[:id])
    @dishes = Dish.where(:event_id => params[:id])

INSERT INTO "events" ("name", "date", "start_time", "end_time", "address", "phone", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "Brand new potluck event!"], ["date", "July 10, 2016"], ["start_time", "7:00"], ["end_time", "10:00"], ["address", "783 Juniper Place"], ["phone", "837-291-3928"], ["user_id", 2]]
---
  def create
    @event = Event.create(event_params)

SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "events" SET "end_time" = ? WHERE "events"."id" = ?  [["end_time", "5:00pm"], ["id", 2]]
---
  def update
    @event = Event.find(params[:id])
    @event.update(event_params)